Autodesk.Revit.DB.Structure.LoadComponent.LoadCaseOrCombinationId
Load case or combination id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.LoadComponent.#ctor(Autodesk.Revit.DB.ElementId,System.Double)
Constructs a new instance of a LoadComponent.
The load case or combination id.
The load case or combination factor.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016